# ANSWERS

### ANS 1

In [2]:
import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

duration = [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [6]:
df['duration']

0    2
1    3
2    6
3    4
Name: duration, dtype: int64

### ANS 2

Loc and iloc are two functions in Pandas that are used to slice a data set in a Pandas DataFrame. The function 
.loc is typically used for label indexing and can access multiple columns, while .iloc is used for integer indexing

### ANS 3

In [8]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [9]:
df.reindex([3 ,0,1,2])

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [10]:
new_df = df.reindex([3 ,0,1,2])

In [14]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [12]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

### .loc function is taking data from index which is numerically equals to 2  and .iloc is taking data from index number 2 which is by default index

In [15]:
### ANS 4

In [16]:
import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]

#Creating a dataframe:

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [17]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.177780  0.232329  0.267362  0.014499  0.503341  0.547882
2  0.355954  0.431274  0.364518  0.770638  0.613298  0.779375
3  0.077544  0.810932  0.422003  0.391203  0.171479  0.542280
4  0.116093  0.615508  0.872394  0.259055  0.303539  0.038376
5  0.727455  0.636568  0.168986  0.462512  0.340818  0.987977
6  0.568744  0.927214  0.450428  0.708840  0.015777  0.558937

In [25]:
df1.mean()

column_1    0.337262
column_2    0.608971
column_3    0.424282
column_4    0.434458
column_5    0.324709
column_6    0.575804
dtype: float64

In [29]:
df1['column_2'].std()

0.25151808117912183

### ANS 5

In [30]:
df1['column_2']

1    0.232329
2    0.431274
3    0.810932
4    0.615508
5    0.636568
6    0.927214
Name: column_2, dtype: float64

In [54]:
column_2 = [ 0.116093 , 0.615508 , 0.872394 , 0.259055 , 0.303539 , 0.038376 ]

In [60]:
df1['column_2']

1    0.232329
2    0.431274
3    0.810932
4    0.615508
5    0.636568
6    0.927214
Name: column_2, dtype: float64

In [75]:
df1['column_2'].mean()

0.6099046852949863

### now we assign new value to column_2

In [80]:
column_2 = [ 0.116093 , 0.615508 , 0.872394 , 0.259055 , 0.303539 , 0.038376 ]

In [87]:
#.loc will take values which is named as column_2 

df1.loc['column_2'] = [ 0.116093 , 0.615508 , 0.872394 , 0.259055 , 0.303539 , 0.038376 ]

In [88]:
df1.loc['column_2']

column_1    0.116093
column_2    0.615508
column_3    0.872394
column_4    0.259055
column_5    0.303539
column_6    0.038376
Name: column_2, dtype: float64

In [89]:
df1.loc['column_2'].mean()

0.3674941666666667

### ANS 6

#The window functions in Pandas are used to perform some sort of calculations across a set of rows that are interrelated 
 with the current row . The windows functions help us to perform the aggregated calculations across various partitions or cross-sections of the data.
 
Windows function in Pandas can be broadly divided into three categories namely- Aggregate, Ranking, and Value.
The Aggregate category of window functions can be of three types namely-

Group,
Rolling, and
Expanding.
The Ranking category of window functions can be of five types namely-

Row Numbers,
Row numbers if of two types:
reset_index()
cumcount()
Rank,
Rank is of four types:
default_rank
min_rank
NA_bottom
descending
Dense rank,
Percent, and
N-Tile / qcut().
The Value category of window functions can be of two types namely-

Lag / Lead, and
First / Last/nth.

### ANS 7

In [103]:
pd.datetime.now()
print("Current Month :", today.month)
print("Current Year :", today.year)

Current Month : 3
Current Year : 2023

/tmp/ipykernel_189/1426660050.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  pd.datetime.now()

### ANS 8

### ANS 8

In [16]:
import pandas as pd

date1 = pd.to_datetime(input("Enter the date YYYY-MM-DD: "))
date2 = pd.to_datetime(input("Enter the date YYYY-MM-DD: "))

date_diff = pd.Timedelta("{hours} hours {minutes} minutes".format(hours=7, minutes=15)) - pd.Timedelta("{hours} hours {minutes} minutes".format(hours=5, minutes=55)) + pd.Timedelta(date2 - date1)

print(date_diff)

Enter the date YYYY-MM-DD:  2023-03-25
Enter the date YYYY-MM-DD:  2023-03-27

2 days 01:20:00

### ANS 11

In [1]:
import pandas as pd
file_path = input('Enter a file path: ')
print(file_path)
pd.read_csv('student.csv')

Enter a file path:  C:\Users\hp\Desktop\PW\student.csv

C:\Users\hp\Desktop\PW\student.csv

   STUDENT ID  TEST SCORE
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85
5           6          82
6           7          78
7           8          85
8           9          90
9          10          85

In [2]:
df = pd.read_csv('student.csv')

In [3]:
df['TEST SCORE'].mean()

83.5

In [4]:

df['TEST SCORE'].median()

85.0

In [5]:
df['TEST SCORE'].mode()

0    85
Name: TEST SCORE, dtype: int64

In [8]:
dict = {'Mean' : df['TEST SCORE'].mean(),
        'Median' : df['TEST SCORE'].median(),
        'Mode' : df['TEST SCORE'].mode()}
df2 = pd.DataFrame(dict)
  
# displaying the DataFrame
display(df2)

   Mean  Median  Mode
0  83.5    85.0    85